"""
正则表达式的规则:
    |           表示: 或者的意思.
    ()          表示: 括号内的内容是1个组
    \num        表示: 引用num分组的内容, 例如: \1 表示引用第1组的数据,  \2 表示引用第2组的数据

    扩展:
        (?P<分组名>)   设置分组
        (?P=分组名)    使用指定的分组
"""
import re

# 需求: 校验html标签
s1 = '<html>我是内容</html>'
# 标签规则: 字母, 数字(1-6), 2 ~ 4位
# 思路1: 常规思路
result = re.match('^<[a-zA-Z1-6]{2,4}>.*</[a-zA-Z1-6]{2,4}>$', s1)
# 思路2: 引用 \num, 可以通过它 引用指定组的内容.
result = re.match('^<([a-zA-Z1-6]{2,4})>.*</\\1>$', s1)    # \1是引用第1组的内容, 即: [a-zA-Z1-6]{2,4}
result = re.match(r'^<([a-zA-Z1-6]{2,4})>.*</\1>$', s1)    # \1是引用第1组的内容, 即: [a-zA-Z1-6]{2,4}


# 外部标签规则: 字母, 数字(1-6), 2 ~ 4位
# 内部标签规则: h数字(1-6), 2位
s2 = '<html><h1>我是标题</h1></html>'
result = re.match(r'^<[a-zA-Z1-6]{2,4}><h[1-6]>.*</h[1-6]></[a-zA-Z1-6]{2,4}>$', s2)    # \1是引用第1组的内容, 即: [a-zA-Z1-6]{2,4}

#                            第1组                第2组
result = re.match(r'^<([a-zA-Z1-6]{2,4})><(h'
                  r'[1-6])>.*</\2></\1>$', s2)    # \1是引用第1组的内容, 即: [a-zA-Z1-6]{2,4}  \2是引用第2组的内容, 即:h[1-6]

# 扩展: 给分组起名字, 方便引用.
result = re.match(r'^<(?P<g1>[a-zA-Z1-6]{2,4})><(?P<g2>h[1-6])>.*</(?P=g2)></(?P=g1)>$', s2)    # \1是引用第1组的内容, 即: [a-zA-Z1-6]{2,4}  \2是引用第2组的内容, 即:h[1-6]

if result:
    print(f'匹配到: {result.group()}')     # 获取所有匹配到的数据
else:
    print('未匹配到!')
print("-" * 20)
