# 需求: 模拟登陆, 只给3次机会.

# 1. 假设初始的账号 和 密码.
username = 'heima'
password = 'ai28'

# 2. 因为只给3次机会, 建议使用 for 循环.
for i in range(3):      # i的值: 0, 1, 2
    # 3. 提示用户录入账号或者密码并接收.
    uname = input('请录入您的账号: ')
    pwd = input('请录入您的密码: ')

    # 4. 判断是否登录成功, 成功则提示, 然后程序结束.
    if uname == username and pwd == password:
        print(f'欢迎您, {uname}!')     # 可以是昵称, nickname
        break   # 记得结束循环.
    else:
        # 5. 不成功, 就判断还有几次登陆机会, 并提示.
        # if i == 2:
        #     print('录入错误次数已达上限, 账号被锁定, 请于管理员联系: 010-123456')
        # else:
        #     print(f'录入有误, 请重新录入, 您还有 {2 - i} 次机会!')     # 2, 1, 0
        print('录入错误次数已达上限, 账号被锁定, 请于管理员联系: 010-123456' if i == 2 else f'录入有误, 请重新录入, 您还有 {2 - i} 次机会!')