# 需求1: 交换 字符串 变量值.
s1 = "刘亦菲"
s2 = "胡歌"

# 方式1: 采用 临时变量(第三方变量)
# tmp = s1
# s1 = s2
# s2 = tmp

# 方式2: 拆包
s1, s2 = s2, s1
print(f's1: {s1},  s2: {s2}')
print('-' * 31)

# 需求2: 交换 数字 变量值.
a = 10
b = 20

# 方式1: 采用 临时变量.
# tmp = a
# a = b
# b = tmp

# 方式2: 拆包
a, b = b, a

# 方式3: 算术运算符.
# a = a + b   # a = 30, b = 20
# b = a - b   # a = 30, b = 10
# a = a - b   # a = 20, b = 10

# 方式4: 位运算符.
# 规律: 1个数字 被 另一个数字 位移或两次, 该数字值不变.   10 ^ 5 ^ 5 = 10
# a = a ^ b   # a = 10 ^ 20,                      b = 20
# b = a ^ b   # a = 10 ^ 20,                      b = a ^ b = 10 ^ 20 ^ 20 = 10
# a = a ^ b   # a = a ^ b = 10 ^ 20 ^ 10 = 20,    b = 10

print(f'a: {a},  b: {b}')