"""
树 结构解释:
    概述:
        它属于数据结构的一种, 属于 非线性结构.
    特点:
        1. 有且只能有1个根节点.
        2. 每个节点都只有1个父节点 及 任意个子节点.  根节点除外(它没有父节点)
        3. 没有子节点的节点称之为: 叶子节点.
    几个名词:
        节点的度:   有几个子节点, 度就是几.
        树的度:     最大的 节点的度.
        树的层:     树的高度, 从根节点开始, 有几代, 层就是几.

    树的种类及存储:
        种类:
            完全二叉树: 除了最后1层, 其它层都是满的, 且最后一层 从左往右, 必须是连续的子节点.
            满二叉树: 所有层次的所有节点都是 满的.
            平衡二叉树: 任意节点的 两个子级的层高 不超过 1.

        存储:
            底层用的是 链表的形式 存储的.

        树的应用场景:
            存储大量的, 海量的数据, 加快检索的速度.
            典型的应用: 数据库的索引. 
"""