"""
函数名 介绍:
    概述:
        Python是一门以 面向对象为基础的 编程语言, 一切皆对象.
        函数名 也可以看做是1个对象, 当然也可以充当 (实际)参数进行传递.
    函数名的作用:
        1. 充当对象, 可以赋值.
        2. 充当实参, 可以传入函数.
"""

# 需求: 演示 函数名 充当 对象.
# 1. 定义 fun01()函数, 里边输出一些内容.
def fun01():
    print('----- 我是 fun01函数 -----')
    print('hello world!')


# 在main函数中调用.
if __name__ == '__main__':
    # 2. 调用fun01()函数.
    fun01()

    # 3. 直接打印对象名, 打印的是什么?
    print(fun01)    # fun01函数 在内存中的地址: <function fun01 at 0x00000235F9067C10>
    print('-' * 20)

    # 4. 输出语句, 打印 函数名(), 打印的是什么?
    print(fun01())  # None, 因为 fun01()是调用函数, 输出语句打印的是 该函数的返回值, 因为无返回值, 所以是: None

    # 5. 函数名 充当对象, 可以赋值.
    # f2 = fun01()        # f2 = None
    f2 = fun01            # 把 fun01 函数的 地址值, 赋值给 f2, 即: f2() = fun01() 效果一致.
    print(f2)             # <function fun01 at 0x00000235F9067C10>
    print(f2())           # None