"""
函数名 介绍:
    概述:
        Python是一门以 面向对象为基础的 编程语言, 一切皆对象.
        函数名 也可以看做是1个对象, 当然也可以充当 (实际)参数进行传递.
    函数名的作用:
        1. 充当对象, 可以赋值.
        2. 充当实参, 可以传入函数.
"""

# 1. 定义普通函数 method(), 输出内容:
def method():
    print('--- 我是 method函数 ---')


# 2. 定义 func()函数, 接收1个参数(函数对象), 然后调用 该函数即可.
def func(fn_name):
    """
    该函数用于接收1个函数对象, 然后再内部 调用此函数.
    :param fn_name: 接收到的函数名, 充当: 实参(对象)
    :return: 无
    """
    fn_name()

# 在main方法中测试
if __name__ == '__main__':
    # 错误演示, 代码会报错.
    # func(10)      # 底层其实是执行了 10()

    # 正确演示, 函数名 作为 实参传递.
    func(method)    # 底层其实是执行了 method(),  这种就是: 回调函数 写法.