"""
约瑟夫环介绍:
    概述:
        它也叫幸运数字, 规则是: 假设有一天你穿越到了古代, 碰巧遇到古代的皇帝在杀人, 不巧的是, 你也在此列.
        规则是: 让所有的"犯人"围成一个圈, 开始数数字, 只要数到3或者3的倍数, 就干掉这个人, 直至剩下最后一人, 她/他站的位置就是: 幸运数字.
        如果可以让你选择自己的站位, 你会站到哪里?
    需求:
        键盘录入1个数字, 表示"犯人"总数, 打印: 幸运数字即可.
    例如:
        10个犯人, 幸运数字是: 4
"""
# 1. 键盘录入参与游戏的总人数, 并接收.
n = int(input('请录入参与游戏的总人数: '))     # 假设: 5

# 2. 根据总人数, 生成对应的 编号列表. 即: [1, 2, 3, 4, 5]
num_list = [i for i in range(1, n + 1)]
# print(num_list)

# 3. 核心细节1: 定义两个变量, num表示当前数到的数字, i表示当前这个人的编号(索引)
num, i = 0, 0

# 4. 具体的游戏过程, 循环操作, 直至列表剩下1个元素.
while len(num_list) != 1:
    # 数数字.
    num += 1

    # 5. 核心细节2: 如果一圈都数完了, 重置 索引为 0, 从头继续数, 下一轮了.
    if i == len(num_list):
        i = 0

    # 6. 如果当前数到的数字是3或者3的倍数, 就从列表中删除这个元素.
    if num % 3 == 0:
        num_list.pop(i)
        # 核心细节3: 删除元素后, 列表长度变化了, 索引要 -1
        i -= 1

    # 7. 当前的人数完后, 下个人开始数数字即可.
    i += 1


# 8. 走到这里, 列表只剩下1个元素了, 它就是幸运数字. 打印即可.
print(f'参与游戏总人数为: {n}, 幸运数字为: {num_list[0]}')