"""
需求:
    传说在很久以前, 有一个意大利青年叫: 斐波那契, 有一天他提出1个非常有意思的问题:
        1. 1对小兔子, 1个月之后会长成1对大兔子.
        2. 1对大兔子, 每个月都会生1对小兔子.
        3. 假设所有兔子都不死的情况下, 问: 1对小兔子, 1年(即: 12个月)之后, 会变成多少对兔子.    144对.

分析思路:
    月份          大兔子对数       小兔子对数       兔子总对数
    1月              0              1               1
    2月              1              0               1
    3月              1              1               2
    4月              2              1               3
    5月              3              2               5
    6月              5              3               8
    ......

总结:
    出口: 前两个月的兔子对数都是 1
    规律: 从第3个月开始, 兔子对数 = 上个月的兔子对数 + 上上个月的兔子对数.
"""


# 1. 定义函数, 计算兔子对数.
def get_rabbit(m):
    """
    根据传入的月份, 计算兔子对数.
    :param m: 月份
    :return: 当月的兔子对数.
    """
    # 出口: 前两个月的兔子对数都是
    # if m == 1 or m == 2:
    if m in [1, 2]:
        return 1

    # 规律: 从第3个月开始, 兔子对数 = 上个月的兔子对数 + 上上个月的兔子对数.
    return get_rabbit(m - 1) + get_rabbit(m - 2)


# 2. 调用函数.
if __name__ == '__main__':
    print(get_rabbit(12))       # 第12个月, 144对
