"""
多任务介绍:
    概述:
        多任务指的是 多任务的执行方式, 按照执行方式不同, 分为: 并行, 并发.
    面试题: 并行 和 并发的区别?
        并发: 多个任务同时请求执行, 但是同一瞬间, CPU只能执行1个任务, 于是安排它们交替执行, 看起来好像是同时执行的, 其实不是.
              CPU在做着高效的切换.
        并行: 多个任务同时执行, 前提, 需要多核CPU.

    进程 和 线程介绍:
        进程: 指的是 可执行程序, 文件, 例如: .exe,   1个 .exe = 1个进程.
        线程: 指的是 进程的执行路径, 执行单元.

        大白话解释:
            车 = 进程,    多辆车 = 多进程.
            车道 = 线程,   单车道 = 单线程.    多车道: 多线程.
    进程介绍:
        进程指的是(Process), 它是CPU分配资源的最小单位, 例如: CPU给微信多少资源, 给QQ多少资源, 给PyCharm多少资源等...
        多进程的基本工作方式: 1个.exe = 1个进程, 程序运行起来会形成主进程, 在主进程上创建子进程.
"""