"""
分支结构介绍:
    概述:
        在条件满足的情况下, 才会被执行的内容, 且只执行一次, 就是: 分支结构.
        分支结构特指的是: if语句.

    if 单分支格式如下:
        if 判断条件:
            语句体

    执行流程:
        1. 先执行判断条件, 看其是否成立.
        2. 如果判断条件成立, 则执行 对应的语句体, 然后if语句执行结果.
        3. 如果判断条件不成立, 则什么都不做.

    细节:
        1. if语句的语句体 较之于 if语句, 是有缩进的(默认是4个空格)
        2. if语句只能控制它的语句体, 外界语句, if是无法控制的.
"""

# 案例1: if格式演示.
a = 10
# if a > 3:
if a < 5:
    print('if 语句体1')
    print('if 语句体2')

print('因为我和if是对齐的, 所以我们是平级, 无论if判断条件是否成立, 我都会执行!')
print('-' * 28)

# 案例2: 上网案例, 键盘录入年龄并接收, 判断是否可以上网. 即: 年龄大于或者等于18岁, 可以上网.
# 1. 键盘录入年龄并接收.
# age_str = input('请录入您的年龄: ')
# 2. 把上述的年龄转成 => int类型
# age = eval(age_str)     # '20' -> 20

# 合并版写法.
# age = eval(input('请录入您的年龄: '))
age = int(input('请录入您的年龄: '))

# 3. 判断是否可以上网.
if age >= 18:
    # 4. 如果可以上网, 则: 打印提示信息.
    print('哥已成年, 可以上网了!')


print('----- end -----')