"""
循环嵌套解释:
    概述:
        循环嵌套指的是 1个循环的 循环体 是另1个循环语句.
    特点:
        外循环执行1次, 内循环执行一圈(一轮).
    案例:
        1. 打印矩形
            *****
            *****
            *****
            *****
            *****
        2. 打印正三角.
        3. 打印倒三角
        4. 打印99乘法表.
"""

# 需求: 打印5行5列的矩形, 要求一次打印 1个*
# 方式1: 分解版.
# 打印第1行
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第2行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第3行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第4行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.


# 打印第5行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.


print('-' * 28)


# 方式2: 合并版.
i = 1
while i <= 5:       # i的值: 1, 2, 3, 4, 5   外循环控制 行数.
    # 循环体, 就是具体的 打印每一行的操作.
    j = 1
    while j <= 5:   # j的值: 1, 2, 3, 4, 5  内循环控制 每行的列数
        print('*', end='')
        j += 1
    print()  # 核心代码, 打印完一行之后, 记得换行.

    i += 1       # 控制条件