"""
需求: 打印99乘法表, 具体如下:
    1 * 1 = 1
    1 * 2 = 2   2 * 2 = 4
    1 * 3 = 3   2 * 3 = 6   3 * 3 = 9
    ......

思路: 学会拆解.
    1. 打印9行9列的矩形 *
    2. 把上述的图形改为 正三角形.
    3. 用 1 * 3 = 3 的格式, 来替换上述的 *
    4. 用 i 和 j 这两个变量, 来填充 乘法公式, 即: 1 * 3 = 3    =>  {j} * {i} = {i * j}
"""

# Step1: 打印9行9列的矩形 *
# i = 1
# while i <= 9:       # 外循环控制 行数
#
#     j = 1
#     while j <= 9:   # 内循环控制: 每行的列数
#         print('*', end='')
#         j += 1  # 内循环的 控制条件.
#     print()     # 核心代码, 换行.
#
#     i += 1  # 外循环的 控制条件.


# Step2: 把上述的图形改为 正三角形.   修改内循环的 判断条件.
# i = 1
# while i <= 9:       # 外循环控制 行数
#
#     j = 1
#     while j <= i:   # 内循环控制: 每行的列数
#         print('*', end='\t')
#         j += 1  # 内循环的 控制条件.
#     print()     # 核心代码, 换行.
#
#     i += 1  # 外循环的 控制条件.


# Step3: 用 1 * 3 = 3 的格式, 来替换上述的 *
# i = 1
# while i <= 9:       # 外循环控制 行数
#
#     j = 1
#     while j <= i:   # 内循环控制: 每行的列数
#         print('1 * 3 = 3', end='\t')
#         j += 1  # 内循环的 控制条件.
#     print()     # 核心代码, 换行.
#
#     i += 1  # 外循环的 控制条件.


# Step4: 用 i 和 j 这两个变量, 来填充 乘法公式, 即: 1 * 3 = 3    =>  {j} * {i} = {i * j}
i = 1
while i <= 9:       # 外循环控制 行数        假设 i = 3

    j = 1
    while j <= i:   # 内循环控制: 每行的列数  此时 j = 1, 2, 3
        print(f'{j} * {i} = {i * j}', end='\t')
        j += 1  # 内循环的 控制条件.
    print()     # 核心代码, 换行.

    i += 1  # 外循环的 控制条件.
