"""
正则表达式 替换, 介绍:
    涉及到的函数:
        import re
        re.compile(正则表达式1).sub(用来替换的字符串2, 要被操作的字符串3)     # 把 3中 能和1 匹配的内容, 用2来替换.

    上述格式的语法糖:
        re.sub(正则表达式1, 用来替换的字符串2, 要被操作的字符串3)

    回顾:
        字符串.replace()   也可以替换, 但是不支持正则写法.
"""
import re
# 案例1: 演示 正则替换, 格式: re.compile(正则表达式1).sub(用来替换的字符串2, 要被操作的字符串3)
# 1. 定义原字符串
s1 = '车主说, 你的刹车片该换了啊, 嘿嘿, 桀桀桀, 你笑的好甜!'
# 2. 定义正则表达式.
rg = r'啊|嘿|桀'

# 3. 开始具体的替换动作.
# 分解版.
# rg_obj = re.compile(rg)              # 传入正则表达式(规则), 获取: 正则对象.
# result = rg_obj.sub('1', s1)    # 通过正则对象, 实现: 正则替换.

# 合并版.
result = re.compile(rg).sub('1', s1)

# 4. 打印处理后的内容
print(result)

# 案例2: 演示正则替换的语法糖, 即: re.sub(正则表达式1, 用来替换的字符串2, 要被操作的字符串3)
s2 = "抽过的烟名: 煊赫门, 荷花, 南京, 中华, 利群, 黄鹤楼..."

# 需求: 把 煊赫门, 荷花, 利群 用 * 来替换.
result2 = re.sub(r'煊赫门|荷花|利群', '*', s2)
print(result2)


# 回顾: 字符串的replace
s3 = '抽过的烟名: 煊赫门, 荷花, 南京'
# result3 = s3.replace('煊赫门', '*')              # 可以
result3 = s3.replace(r'煊赫门|荷花', '*')    # 不可以, replace()不支持正则
print(result3)