'''
    需求:
        1. 先打印提示界面(1-6的数字), 让用户选择他/她要进行的操作.
        2. 当用户选择1的时候, 实现操作: 添加学生(学生编号, 学生姓名, 手机号).
        3. 当用户选择2的时候, 实现操作: 删除学生(根据编号删除)
        4. 当用户选择3的时候, 实现操作: 修改学生信息(只能改姓名, 手机号)
        5. 当用户选择4的时候, 实现操作: 查询单个学生信息(根据姓名查)
        6. 当用户选择5的时候, 实现操作: 查询所有学生信息
        7. 当用户选择6的时候, 实现操作: 退出系统
    步骤/思路:
        1. 定义函数 print_info()  , 打印提示信息.
        2. 自定义while True循环逻辑, 实现: 用户录入什么数据, 就进行相应的操作
          注意: 处理一下非法值.
        3. 自定义函数 add_info(), 实现: 添加学生
          编号必须唯一
        4. 自定义函数 delete_info(), 实现: 删除学生
          根据编号删除
        5. 自定义函数 update_info(), 实现: 修改学生信息
          根据编号修改, 只能修改: 姓名, 手机号.
        6. 自定义函数 search_info(), 实现: 查询某个学生信息.
          根据姓名查询
        7. 自定义函数 search_all(), 实现: 查询所有学生的信息.

Day09下午答辩:
    1. 以组的形式答辩, 1人上台宣讲(PPT形式), 思路: 项目名, 小组成员及职责, 具体的项目截图(效果图), 项目亮点, 遇到的Bug及解决方案...
    2. 宣讲结束后, 其他组成员, 可以进行提问.
    3. 投票.
    4. 项目的"延伸"思路:
        基本版: 学生管理系统 + 列表嵌套字典
        升级版: 学生管理系统 + 文件
        进阶版: 学生管理系统 + 数据库
        终极版: 黑马**游戏, 两套系统 A: (管理员系统(就是学生管理系统), 可以管理用户, 增删改查), B:游戏系统(登陆, 注册, 玩儿游戏, 石头剪刀布, 猜数字, 打印图形, 约瑟夫环)..
'''
