"""
if嵌套解释:
    概述:
        它指的是 1个if语句的 语句体 是 另1个if语句.
    格式:
        if 条件1:
            语句体1

            if 条件:
                语句体
            ......

        else:
            语句体2

            if 条件:
                语句体
            ......
"""

# 需求: 坐公交车, 有座位可以坐下.
# 要求:  输入公交卡当前的余额, 只要够2元, 就可以上公交车. 如果车上有空座位, 就可以坐下.

# 1. 提示用户录入公交卡的余额, 并接收, 记得转成: 整数.
money = eval(input('请录入公交卡的余额: '))

# 2. 判断公交卡的余额是否 够2元, 如果够: 则可以上车.
if money >= 2:
    print('滴, 刷卡成功, 请上车!')
    # 4. 提示用户录入空座位的情况, 并接收.
    seat = int(input('请录入空座位数量: '))
    # 5. 判断是否有空座位, 如果有, 则可以坐下.
    if seat > 0:
        print('有空座位, 可以坐下了!')
    else:
        # 6. 如果没有, 则: 需要站着.
        print('哎呀, 人太多了, 没位置了, 站一会儿吧!')

# 3. 如果不够, 则不允许上车.
else:
    print('滴, 余额不足, 请充值, 本次无法乘车, 可以跟车跑!')