"""
循环结构介绍:
    概述:
        它属于流程控制语句的一种, 表示: 周而复始, 即: 满足某些条件的情况下, 重复的做某些事儿.
    分类:
        while循环         更适用于 循环次数不固定的情况.
        for循环           更适用于 循环次数固定的情况.
    循环的要素:
        1. 初始化条件.    表示 循环从哪里开始执行.
        2. 判断条件.      表示 循环什么时候终止, 只要判断条件满足, 循环就一直执行.
        3. 循环体.       表示 判断条件成立的情况下, 重复做的事儿.
        4. 控制条件.     表示 控制初始化条件变化的.

    while循环详解:
        格式:
            初始化条件1
            while 判断条件2:
                循环体3
                控制条件4

        执行流程:
            第1次循环:   1, 2, 3, 4           假设: 判断条件成立.
            重复循环:    2, 3, 4              假设: 判断条件成立.
            最后1次循环: 2                    判断条件不成立, 循环结束.
"""

# 需求: 打印 5次 HellWorld.
i = 1                                           # 初始化条件, 表示循环从 1 开始
while i <= 5:       # i的值: 1, 2, 3, 4, 5       # 判断条件, 成立则循环继续向下执行.
    # 走这里, 说明 判断条件成立, 执行循环体.
    print(f'Hello World! {i}')                  # 循环体, 表示判断条件满足的情况下, 重复的做某些事儿.

    # 循环执行一次, i 就 + 1
    # i = i + 1
    i += 1                                      # 控制条件, 控制变量(初始化条件)变化的.
