"""
关于循环, 另一种比较重要的就是 统计思想了, 例如: 统计水仙花数的个数.

需求1: 打印所有的水仙花数.
需求2: 统计水仙花数的个数.

水仙花数解释:
    1. 它是1个三位数.
    2. 它的各个位数的立方和相加 = 它本身.
    3. 例如: 153 = 1*1*1 + 5*5*5 + 3*3*3 = 153, 所以 153就是水仙花数.
"""

# 需求1: 打印所有的水仙花数
# 1. 定义初始化值, 从 100 开始.
i = 100
# 2. while循环, 获取到 100 ~ 1000之间所有的值, 包左不包右.
while i < 1000:     # 假设:  i = 2153
    # 3. 获取该数字的各个位数 数字.
    ge = i  // 1  % 10
    shi = i // 10 % 10
    bai = i // 100 % 10

    # 4. 判断是否是水仙花数, 如果是, 就打印.
    if ge * ge * ge + shi * shi * shi + bai * bai * bai == i:
        # 走这里, 是水仙花数.
        print(i)

    # 5. 控制条件, 记得: i += 1
    i += 1
print('-' * 28)


# 需求2: 统计水仙花数的个数.

# 定义求和变量count, 用于记录 水仙花数的个数.
count = 0

# 1. 定义初始化值, 从 100 开始.
i = 100
# 2. while循环, 获取到 100 ~ 1000之间所有的值, 包左不包右.
while i < 1000:     # 假设:  i = 2153
    # 3. 获取该数字的各个位数 数字.
    ge = i  // 1  % 10
    shi = i // 10 % 10
    bai = i // 100 % 10

    # 4. 判断是否是水仙花数, 如果是, 就打印.
    if ge * ge * ge + shi * shi * shi + bai * bai * bai == i:
        # 走这里, 是水仙花数. 计数器 + 1
        count += 1

    # 5. 控制条件, 记得: i += 1
    i += 1
# 6. 循环结束后, 打印程序的运行结果即可.
print(f'水仙花数的个数为: {count}')