"""
列表介绍:
    概述:
        它属于容器类型的一种, 属于 可变类型. 它可以同时存储 多个元素.
    格式:
        格式1:  列表名 = [值1, 值2, 值3...]
        格式2:  列表名 = list()
    细节:
        1. 列表可以同时存储多个元素, 可以是不同类型的, 也可以是同类型的元素.
        2. 实际开发中, 为了方便统一操作, 建议: 列表存储的多个元素 是 同类型.
        3. 列表的元素也是有索引的, 且索引也是从 0(正向), -1(逆向) 开始的.
        4. 列表和字符串一样, 也是支持 "切片" 操作的, 规则都一样:  列表名[起始索引:结束索引:步长]
"""

# 1. 定义列表.
list1 = [10, 20.3, True, 'abc']
list2 = list()
list3 = []          # 可以理解为 [] 是 list()的语法糖.

# 2. 打印列表(元素值)
print(f'list1: {list1}')    # list1: [10, 20.3, True, 'abc']
print(f'list2: {list2}')    # list2: []
print(f'list3: {list3}')    # list3: []

# 3. 打印列表(类型)
print(type(list1))  # <class 'list'>
print(type(list2))  # <class 'list'>
print(type(list3))  # <class 'list'>
print('-' * 28)


# 4. 打印列表的 某个元素. 即: 测试列表的索引.
print(list1[1])       # 20.3, 正向索引
print(list1[-3])      # 20.3, 逆向索引.

# 初体验: 切片
print(list1[1:])      # [20.3, True, 'abc']