"""
容器类型介绍:
    背景:
        之前我们学的变量只能存储简单的, 单一的数据, 如果要同时存储多个值, 变量就实现不了了. 此时就需要用 容器类型 来实现.
    例如:
        存储咱们所有人的姓名,  年龄...
    分类:
        字符串:
        列表:
        字典:
        元组:
        集合:

字符串:
    概述:
        它属于容器类型的一种, 属于 不可变类型.  它由多个字符组成.
    例如:
        'abc',  'hello world', '张三'...
    定义格式:
        方式1: 一对引号, 单双引号均可.
        方式2: 三引号, 可以保留字符串的格式.
    下标:
        ...
    切片:
        ...
    常用函数:
        ...
    案例:
        ...
"""

# 1. 通过 一对引号的方式 定义字符串, 单双引号均可.
s1 = '张三'
s2 = "李四"
print(s1, s2)       # 同时输出多个值.
print(type(s1), type(s2))


# 2. 通过 三引号 的方式定义字符串.
s3 = """
select
    [distinct] 列1, 列2...
from
    表名
where
    组前筛选
group by
    分组字段
having
    组后筛选
order by
    排序字段 [asc | desc]
limit
    起始索引, 数据条数;
"""
print(s3)
print(type(s3))
print('-' * 28)

# 3. 字符串特殊格式, 定义字符串变量, 记录:  I'm Tom!
s4 = "I'm Tom!"
s5 = 'I\'m Tom!'
print(s4, s5)
print(type(s4), type(s5))
print('-' * 28)


# 4. 字符串遍历(也叫迭代, 即: 逐个获取 容器类型中 每个元素的动作)
for i in s5:
    print(i)        # i就是字符串s5中的 每个字符, 例如: 'I', 'm'...