"""
运算符解释:
    概述:
        用来连接 变量 或者 变量值的 符号, 就叫: 运算符.
    扩展:
        用 什么运算符 连接起来的式子 就叫什么表达式.
    例如:
        a + b =>  因为 + 是算术运算符, 所以 a + b 是 算术表达式.
        a > b =>  因为 > 是关系运算符, 所以 a > b 是 关系表达式.
        ......

    常用的运算符:
        算术运算符:
        赋值运算符:
        符合赋值运算符:

        关系(比较)运算符:
        逻辑运算符:
        三元表达式(三目运算符):

算术运算符:
    顾名思义, 就使用来做 算术运算的, 常用的有: +, -, *, /, //, **, %

赋值运算符:
    就是我们用的=, 即: 把 右边的内容, 赋值给左边的变量.

复合赋值运算符:
    常用的符号如下: +=, -=, *=, /=, //=, %=, **=
    先进行算术运算, 然后再进行赋值, 例如: a += b, 结果是: a = a + b, 即: 把 a + b的结果, 重新赋值给变量a

如果你要局部选中, 可以选中代码, 然后输入 shift + alt + E, 然后把选中的代码到 Python终端中运行.
"""

# 1. 演示 算术运算符
# a = 10
# b = 3
a, b = 10, 3        # 同时定义多个变量.

print(a + b)    # 13
print(a - b)    # 7
print(a * b)    # 30
print(a / b)    # 3.3333333333333335, 小数用的是近似于的思想.
print(a // b)   # 整除, 3
print(a % b)    # 1
print(a ** b)   # 1000
print('-' * 28)

# 2. 演示赋值运算符.
c = 100         # 把 整数100当做变量值, 赋值给变量c
print(c)
print('-' * 28)


# 3. 演示复合赋值运算符, 此处以 += 举例.
a += b          # 相当于 a = a + b
print(a, b)     # 13, 3

a //= b         # a = a // b = 13 // 3 = 4
print(a, b)     # 4, 3